/***************************************************************************
*FileName:		BH1750.h
*Description: 光照强度传感器的接口声明
*Author:			yhs
*CreatDate:		2018-7-18
*Copyright		www.yanghs97@163.com
*UpDate:			修改人		修改内容
*2018-7-11		杨淏森	 	添加初始化函数实现
****************************************************************************/
#ifndef __BH1750_H_
#define __BH1750_H_

#include <stm32f10x.h>

#define BH1750_ADDR					0XB8	//器件地址
#define BH1750_PWOFF				0X00	//断电
#define BH1750_PWON					0X01	//通电
#define BH1750_RESET				0X07	//复位数字寄存器中的值
#define BH1750_H_RE_MOD2		0X11 	//高精度模式2 解析度为0.5
#define BH1750_CMT_H				0X42  //设置透光率为100% 设置寄存器高8位
#define BH1750_CMT_L				0X65	//设置透光率为100% 设置寄存器低8位

/*******************************
函数名：BH1750_Init
函数功能：初始化BH1750
函数返回值：成功返回0
*******************************/
void BH1750_Init(void);

/*******************************
函数名：BH1750_Measure
函数功能：获取一次BH1750的测量值
函数返回值：成功返回0
注意：每次读取光照强度数据至少要间隔120ms
			在高精度模式下传感器转换一次数据需要至少120ms时间
*******************************/
unsigned char BH1750_Measure(float* Result);
/*******************************
函数名：BH1750_Measure
函数功能：获取一次BH1750的原始测量值
函数返回值：成功返回0
注意：每次读取光照强度数据至少要间隔120ms
			在高精度模式下传感器转换一次数据需要至少120ms时间
*******************************/
unsigned char BH1750_Original_Measure(u16* Result);


#endif

